{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Computer Science",
      "department": "Faculty of Science",
      "duration": "2017-2022",
      "school_name": "Ryerson/Toronto Metropolitan University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AnthonyPham",
  "highlighted_projects": [
    {
      "description": "Worked in a team to develop a functioning Android application using Android Studio, Java and Google Firebase. The application provides CRUD operations to create and use grocery lists, as well as the ability to read barcodes and authenticate users by recording usernames and passwords onto the live Firebase database. The team collaborated using GitHub and held daily meetings to create charts and discuss project scheduling.",
      "name": "Grocery List Application"
    },
    {
      "description": "Created a Java program that finds the the most relevant document in a collection of over 3000 documents. Preprocessed queries to filter stop words, stem words and non-alphanumeric values and stored document frequency, term frequency, position and document ID for every term. This information was then used to score the document relevancy for any user query to find the most relevant documents.",
      "name": "CACM Document Retrieval Application"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux Cluster Monitoring Agent that creates a method for monitoring data collected into SQL tables running on a containerized PostgreSQL platform. Through a virtual machine hosted on the google cloud platform, a docker container is created which hosts the Postgres database. The database is populated with hardware specifications of the active computer via various bash scripts after which several SQL queries can be run to check on the integrity of the data received. The process of data collection is automated by use of a crontab, and the job is set to collect a new piece of data every minute. The whole application is built and managed with Git and stored on a Github repository. To summarize the following technologies were used to build the project: Linux, CentOS, Docker, PostgreSQL, Bash, Git, Github, Google Cloud Platform, Crontab, and Intellij.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Developed an application that allows a user to post, show and delete Tweets utilizing the official Twitter REST API via a combination of java implementation and dockerization. The application is designed using MVC architecture, which consists of a model, controller layer, service layer and data access layer (DAO). The application uses Java, JUnit, Mockito, Spring, Docker, HTTP and JSON.",
        "JDBC App: Developed an application that is used to connect and interact with a PostgreSQL database. It can perform CRUD (creation, read, update and deletion) operations on the database. The application uses Java, JDBC, Maven, SQL, Docker and PostgreSQL.",
        "Grep App: Developed an application that emulates the functionality of the linux Grep command. It can search files and directories to match a given string within files by parsing regular expressions provided at execution. The application uses Maven, Stream API's, and Java."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Anthony Pham",
  "others": [
    {
      "bullets": [
        "CompTIA ITF+ (2022)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Minor in Philosophy"
      ],
      "title": "Awards"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked in a team of software developers in an Agile/Scrum work environment, consisting of daily scrum meetings and a two-week sprint. Various projects spanning several techincal fields were developed and the team lead role held various responsibilities such as leading the daily scrum meetings and helping provide insight to any given project through discussions during daily scrum.Worked with technologies such as PostgreSQL, Docker, Maven, API's and Github.",
      "duration": "2022-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "HTML/CSS",
      "Maven",
      "MongoDB",
      "Data Structures"
    ],
    "familiar": [
      "C/C++",
      "Javascript",
      "Python",
      "JUnit",
      "Hadoop"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate from Ryerson University (TMU), with a degree Computer Science. During my education I was able to learn the core concepts of computer science, specifically in the fields of software engineering, data mining, and database systems. I am currently a software developer at Jarvis Consulting Group where I am refining the fundamentals that I developed during my education, so that I may better integrate with a live working environment. At Jarvis I am actively employing  an agile workflow and broadening my technical horizons with various projects using technologies such as Java, Docker, PostGreSQL amongst others."
}
